<?php

namespace App\Database\Seeds;

use CodeIgniter\Database\Seeder;

class Dsc extends Seeder
{
    public function run()
    {
        $bnWard=[
            'ওয়ার্ড ১', 'ওয়ার্ড ২', 'ওয়ার্ড ৩', 'ওয়ার্ড ৪', 'ওয়ার্ড ৫', 'ওয়ার্ড ৬', 'ওয়ার্ড ৭', 'ওয়ার্ড ৮', 'ওয়ার্ড ৯', 'ওয়ার্ড ১০', 'ওয়ার্ড ১১', 'ওয়ার্ড ১২', 'ওয়ার্ড ১৩', 'ওয়ার্ড ১৪', 'ওয়ার্ড ১৫', 'ওয়ার্ড ১৬', 'ওয়ার্ড ১৭', 'ওয়ার্ড ১৮', 'ওয়ার্ড ১৯', 'ওয়ার্ড ২০', 'ওয়ার্ড ২১', 'ওয়ার্ড ২২', 'ওয়ার্ড ২৩', 'ওয়ার্ড ২৪', 'ওয়ার্ড ২৫', 'ওয়ার্ড ২৬', 'ওয়ার্ড ২৭', 'ওয়ার্ড ২৮', 'ওয়ার্ড ২৯', 'ওয়ার্ড ৩০', 'ওয়ার্ড ৩১', 'ওয়ার্ড ৩২', 'ওয়ার্ড ৩৩', 'ওয়ার্ড ৩৪', 'ওয়ার্ড ৩৫', 'ওয়ার্ড ৩৬', 'ওয়ার্ড ৩৭', 'ওয়ার্ড ৩৮', 'ওয়ার্ড ৩৯', 'ওয়ার্ড ৪০', 'ওয়ার্ড ৪১', 'ওয়ার্ড ৪২', 'ওয়ার্ড ৪৩', 'ওয়ার্ড ৪৪', 'ওয়ার্ড ৪৫', 'ওয়ার্ড ৪৬', 'ওয়ার্ড ৪৭', 'ওয়ার্ড ৪৮', 'ওয়ার্ড ৪৯', 'ওয়ার্ড ৫০', 'ওয়ার্ড ৫১', 'ওয়ার্ড ৫২', 'ওয়ার্ড ৫৩', 'ওয়ার্ড ৫৪', 'ওয়ার্ড ৫৫', 'ওয়ার্ড ৫৬', 'ওয়ার্ড ৫৭', 'ওয়ার্ড ৫৮', 'ওয়ার্ড ৫৯', 'ওয়ার্ড ৬০', 'ওয়ার্ড ৬১', 'ওয়ার্ড ৬২', 'ওয়ার্ড ৬৩', 'ওয়ার্ড ৬৪', 'ওয়ার্ড ৬৫', 'ওয়ার্ড ৬৬', 'ওয়ার্ড ৬৭', 'ওয়ার্ড ৬৮', 'ওয়ার্ড ৬৯', 'ওয়ার্ড ৭০', 'ওয়ার্ড ৭১', 'ওয়ার্ড ৭২', 'ওয়ার্ড ৭৩', 'ওয়ার্ড ৭৪', 'ওয়ার্ড ৭৫'
        ];

        $model= new \App\Models\Unions();
        for($i=1;$i<30;$i++)
        {
            $data=[
                "thana_id"=>'499',
                 "en_name"=>"ward ".$i+1,
                 "bn_name"=>$bnWard[$i], 
            ];

            $model->save($data);
        }
    }
}
